const fs = global.nodemodule["fs-extra"];
module.exports.config = {
  name: "goibot2",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "𝑨𝒔𝒊𝒇 𝑴𝒂𝒉𝒎𝒖𝒅",
  description: "𝗠𝘂𝘀𝗶𝗰 𝗕𝗼𝘁",
  commandCategory: "𝗡𝗼-𝗣𝗿𝗲𝗳𝗶𝘅",
  usages: "𝗡𝗼 𝗣𝗿𝗲𝗳𝗶𝘅 𝗡𝗲𝗲𝗱𝗲𝗱",
  cooldowns: 5,
};

module.exports.handleEvent = async function({ api, event, args, Threads, Users }) {
  var { threadID, messageID, reason } = event;
  const moment = require("moment-timezone");
  const time = moment.tz("Asia/Dhaka").format("𝗗𝗗/𝗠𝗠/𝗬𝗬𝗬𝗬 || 𝗛𝗛:𝗺𝗺:𝘀𝘀");
  var idgr = `${event.threadID}`;
  var id = event.senderID;
  var name = await Users.getNameUser(event.senderID);

  function toMathBoldItalic(text) {
    const map = {
      'A': '𝑨', 'B': '𝑩', 'C': '𝑪', 'D': '𝑫', 'E': '𝑬', 'F': '𝑭', 'G': '𝑮', 'H': '𝑯', 'I': '𝑰', 'J': '𝑱', 'K': '𝑲', 'L': '𝑳', 'M': '𝑴', 'N': '𝑵', 'O': '𝑶', 'P': '𝑷', 'Q': '𝑸', 'R': '𝑹', 'S': '𝑺', 'T': '𝑻', 'U': '𝑼', 'V': '𝑽', 'W': '𝑾', 'X': '𝑿', 'Y': '𝒀', 'Z': '𝒁',
      'a': '𝒂', 'b': '𝒃', 'c': '𝒄', 'd': '𝒅', 'e': '𝒆', 'f': '𝒇', 'g': '𝒈', 'h': '𝒉', 'i': '𝒊', 'j': '𝒋', 'k': '𝒌', 'l': '𝒍', 'm': '𝒎', 'n': '𝒏', 'o': '𝒐', 'p': '𝒑', 'q': '𝒒', 'r': '𝒓', 's': '𝒔', 't': '𝒕', 'u': '𝒖', 'v': '𝒗', 'w': '𝒘', 'x': '𝒙', 'y': '𝒚', 'z': '𝒛'
    };
    return text.split('').map(char => map[char] || char).join('');
  }

  var tl = [
    "𝗧𝘂𝗺𝗶 𝗮𝗺𝗮𝗿 𝗵𝗼𝘆𝗲 �𝗮𝗵𝗮𝗸𝗸𝗶, 𝗔𝗺𝗶 𝗧𝗼𝗺𝗮𝗸 𝗕𝗵𝗮𝗹𝗼𝗯𝗼 𝗕𝗼𝗹𝗯𝗼 𝗡𝗮",
    "𝗧𝘂𝗺𝗶 𝗝𝗲 𝗔𝗺𝗮𝗿 𝗛𝗼𝗯𝗲, 𝗧𝗮𝗵𝗼𝗹𝗲 𝗧𝗼𝗯𝗼 𝗦𝗼𝗯 𝗞𝗶𝗰𝗵𝘂 𝗗𝗶𝗻𝗲 𝗣𝗮𝗿𝗯𝗼 𝗡𝗮",
    "𝗔𝗺𝗮𝗿 𝗣𝗿𝗮𝗻𝗲𝗿 𝗠𝗮𝗷𝗵𝗲 𝗧𝘂𝗺𝗶, 𝗧𝘂𝗺𝗶 𝗖𝗵𝗮𝗿𝗮 𝗞𝗼𝗻𝗼 𝗚𝗮𝗻 𝗡𝗲𝗶",
    "𝗧𝘂𝗺𝗶 𝗔𝗺𝗮𝗿 𝗦𝗼𝗻𝗱𝗵𝗮𝗻, 𝗔𝗺𝗮𝗿 𝗦𝗼𝗯 𝗞𝗶𝗰𝗵𝘂, 𝗔𝗺𝗮𝗿 𝗦𝗵𝗲𝘀𝗵 𝗢𝗯𝗶𝗱𝗵𝗮𝗻",
    "𝗧𝘂𝗺𝗶 𝗘𝗸𝗮 𝗕𝗮𝗿 𝗣𝗵𝗶𝗿𝗲 𝗔𝗦𝗼, 𝗔𝗺𝗶 𝗧𝗼𝗺𝗮𝗸 𝗡𝗶𝗷𝗲𝗿 𝗞𝗼𝗿𝗲 𝗡𝗲𝗯𝗼",
    "𝗔𝗺𝗮𝗿 𝗗𝗶𝗯𝗮 𝗥𝗮𝘁𝗶 𝗧𝘂𝗺𝗶, 𝗔𝗺𝗮𝗿 𝗦𝗼𝗯 𝗦𝗼𝗸𝗵𝗼 𝗧𝘂𝗺𝗶",
    "𝗧𝘂𝗺𝗶 𝗝𝗮𝗸𝗵𝗼𝗻 𝗔𝗺𝗮𝗿 𝗞𝗮𝗰𝗵𝗲, 𝗧𝗮𝗸𝗵𝗼𝗻 𝗦𝗼𝗯 𝗞𝗶𝗰𝗵𝘂 𝗣𝗮𝗶",
    "𝗔𝗺𝗮𝗿 𝗠𝗼𝗻𝗲𝗿 𝗞𝗼𝘁𝗵𝗮 𝗦𝘂𝗻𝗼, 𝗧𝘂𝗺𝗶 𝗖𝗵𝗮𝗿𝗮 𝗞𝗲𝘂 𝗡𝗲𝗶",
    "𝗧𝘂𝗺𝗶 𝗔𝗺𝗮𝗮𝗿 𝗛𝗼𝗶𝗲 𝗧𝗵𝗮𝗸𝗹𝗲, 𝗔𝗺𝗶 𝗕𝗲𝗹𝗲𝘁𝗲 𝗣𝗮𝗿𝗶 𝗡𝗶",
    "𝗔𝗺𝗮𝗿 𝗣𝗿𝗶𝘆𝗼 𝗛𝗼𝗯𝗼 𝗧𝘂𝗺𝗶, 𝗔𝗺𝗶 𝗦𝗼𝗯 𝗖𝗵𝗲𝘆𝗲 𝗣𝗿𝗶𝘆𝗼"
  ];
  
  var rand = tl[Math.floor(Math.random() * tl.length)];
  const creditName = toMathBoldItalic("Asif") + " " + toMathBoldItalic("Mahmud");

  if (event.body.toLowerCase().includes("song")) {
    let msg = {
      body: 
        `╔════ஜ۩۞۩ஜ═══╗\n` +
        `🎵 𝗛𝗘𝗟𝗟𝗼 ${name} 💖\n` +
        `╚════ஜ۩۞۩ஜ═══╝\n\n` +
        `『  ${rand} 』\n\n` +
        `✦⋆⋅☆⋅⋆✦⋆⋅☆⋅⋆✦⋆⋅☆⋅⋆✦\n\n` +
        `𝗖𝗿𝗲𝗱𝗶𝘁𝘀 » ${creditName}\n` +
        `𝗧𝗶𝗺𝗲 » ${time}\n` +
        `✦⋆⋅☆⋅⋆✦⋆⋅☆⋅⋆✦⋆⋅☆⋅⋆✦`
    };
    return api.sendMessage(msg, threadID, messageID);
  };
}

module.exports.run = function({ api, event, client, __GLOBAL }) { }
