module.exports.config = {
	name: "mathematics",
	version: "1.0.0",
	hasPermssion: 0,
	credits: "𝑨𝒔𝒊𝒇 𝑴𝒂𝒉𝒎𝒖𝒅",
	description: "𝑴𝒂𝒕𝒉𝒆𝒎𝒂𝒕𝒊𝒄𝒔 𝑭𝒐𝒓𝒎𝒖𝒍𝒂 𝑺𝒉𝒆𝒆𝒕",
	commandCategory: "𝑺𝒕𝒖𝒅𝒚 𝒂𝒏𝒅 𝑳𝒆𝒂𝒓𝒏𝒊𝒏𝒈",
	cooldowns: 0
};

module.exports.run = ({ event, api }) => api.sendMessage(`📚 𝑴𝒂𝒕𝒉𝒆𝒎𝒂𝒕𝒊𝒄𝒔 𝑭𝒐𝒓𝒎𝒖𝒍𝒂 𝑺𝒉𝒆𝒆𝒕

𝑩𝒂𝒔𝒊𝒄 𝑭𝒐𝒓𝒎𝒖𝒍𝒂𝒔

1/ 𝑺𝒒𝒖𝒂𝒓𝒆 𝒐𝒇 𝒔𝒖𝒎: (𝒂 + 𝒃)² = 𝒂² + 2𝒂𝒃 + 𝒃² = (𝒂 − 𝒃)² + 4𝒂𝒃

2/ 𝑺𝒒𝒖𝒂𝒓𝒆 𝒐𝒇 𝒅𝒊𝒇𝒇𝒆𝒓𝒆𝒏𝒄𝒆: (𝒂 − 𝒃)² = 𝒂² - 2𝒂𝒃 + 𝒃² = (𝒂 + 𝒃)² − 4𝒂𝒃

3/ 𝑫𝒊𝒇𝒇𝒆𝒓𝒆𝒏𝒄𝒆 𝒐𝒇 𝒔𝒒𝒖𝒂𝒓𝒆𝒔: 𝒂² − 𝒃² = (𝒂 − 𝒃)(𝒂 + 𝒃)

4/ 𝑪𝒖𝒃𝒆 𝒐𝒇 𝒔𝒖𝒎: (𝒂 + 𝒃)³ = 𝒂³ + 3𝒂²𝒃 + 3𝒂𝒃² + 𝒃³

5/ 𝑪𝒖𝒃𝒆 𝒐𝒇 𝒅𝒊𝒇𝒇𝒆𝒓𝒆𝒏𝒄𝒆: (𝒂 − 𝒃)³ = 𝒂³ − 3𝒂²𝒃 + 3𝒂𝒃² − 𝒃³

6/ 𝑺𝒖𝒎 𝒐𝒇 𝒄𝒖𝒃𝒆𝒔: 𝒂³ + 𝒃³ = (𝒂 + 𝒃)(𝒂² − 𝒂𝒃 + 𝒃²) = (𝒂 + 𝒃)³ − 3𝒂²𝒃 − 3𝒂𝒃² = (𝒂 + 𝒃)³ − 3𝒂𝒃(𝒂 + 𝒃)

7/ 𝑫𝒊𝒇𝒇𝒆𝒓𝒆𝒏𝒄𝒆 𝒐𝒇 𝒄𝒖𝒃𝒆𝒔: 𝒂³ − 𝒃³ = (𝒂 − 𝒃)(𝒂² + 𝒂𝒃 + 𝒃²) = (𝒂 − 𝒃)³ + 3𝒂²𝒃 − 3𝒂𝒃² = (𝒂 − 𝒃)³ + 3𝒂𝒃(𝒂 − 𝒃)

━━━━━━━━━━━━━━━━━━━━

𝑨𝒅𝒗𝒂𝒏𝒄𝒆𝒅 𝑭𝒐𝒓𝒎𝒖𝒍𝒂𝒔

1/ (𝒂 + 𝒃 + 𝒄)³ = 𝒂³ + 𝒃³ + 𝒄³ + 3(𝒂 + 𝒃)(𝒃 + 𝒄)(𝒂 + 𝒄)

2/ 𝒂³ + 𝒃³ + 𝒄³ − 3𝒂𝒃𝒄 = (𝒂 + 𝒃 + 𝒄)(𝒂² + 𝒃² + 𝒄² − 𝒂𝒃 − 𝒃𝒄 − 𝒂𝒄)

3/ (𝒂 − 𝒃 − 𝒄)² = 𝒂² + 𝒃² + 𝒄² - 2𝒂𝒃 + 2𝒃𝒄 − 2𝒂𝒄

4/ (𝒂 + 𝒃 + 𝒄)² = 𝒂² + 𝒃² + 𝒄² + 2𝒂𝒃 + 2𝒃𝒄 + 2𝒂𝒄

5/ (𝒂 + 𝒃 − 𝒄)² = 𝒂² + 𝒃² + 𝒄² + 2𝒂𝒃 − 2𝒃𝒄 − 2𝒂𝒄
`, event.threadID, event.messageID);
