const fs = require("fs");
module.exports.config = {
	name: "solarsystem",
    version: "1.1.8",
	hasPermssion: 0,
	credits: "𝑨𝒔𝒊𝒇 𝑴𝒂𝒉𝒎𝒖𝒅", 
	description: "𝙎𝙤𝙡𝙖𝙧 𝙎𝙮𝙨𝙩𝙚𝙢 𝙞𝙣𝙛𝙤𝙧𝙢𝙖𝙩𝙞𝙤𝙣 𝙖𝙣𝙙 𝙙𝙚𝙩𝙖𝙞𝙡𝙨",
	commandCategory: "𝙉𝙚𝙬𝙨",
	usages: "",
    cooldowns: 5, 
};

module.exports.handleReply = async ({ api, event, handleReply }) => {
const { threadID, messageID, senderID } = event;
    switch(handleReply.type) {
        case "choosee": {
            switch(event.body) {

				case "1":
					api.sendMessage({
						body: "𝟭. 𝗧𝗵𝗲 𝗦𝘂𝗻 ☀️\n\n𝘚𝘶𝘳𝘺𝘢 𝘳𝘢 𝘚𝘶𝘳𝘺𝘢 𝘣𝘢𝘭𝘢 𝘩𝘢𝘺 (𝘌𝘯𝘨𝘭𝘪𝘴𝘩: 𝘚𝘶𝘯; 𝘢𝘯𝘺𝘰 𝘑𝘢𝘱𝘢𝘯 𝘯𝘢𝘮𝘦 𝘥𝘪𝘺𝘦𝘰 𝘫𝘢𝘯𝘢 𝘫𝘢𝘺), 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘬𝘦𝘯𝘥𝘳𝘦 𝘵𝘩𝘢𝘬𝘢 𝘵𝘢𝘳𝘢, 𝘱𝘳𝘢𝘺𝘢 99.86% 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘣𝘩𝘢𝘳 𝘬𝘢𝘫𝘦 𝘬𝘢𝘳𝘵𝘩 𝘢𝘣𝘰𝘯 𝘢𝘯𝘺𝘢 𝘨𝘳𝘢𝘩𝘢, 𝘶𝘱𝘢𝘨𝘳𝘢𝘩𝘢, 𝘶𝘭𝘬𝘢𝘬𝘢𝘱𝘪𝘯𝘥𝘢, 𝘥𝘩𝘶𝘭𝘪 𝘢𝘥𝘪 𝘚𝘶𝘳𝘺𝘢𝘬𝘦 𝘱𝘢𝘳𝘪𝘬𝘳𝘢𝘮𝘢 𝘬𝘢𝘳𝘦. 𝘚𝘶𝘳𝘺𝘢 𝘰 𝘉𝘩𝘶𝘮𝘪𝘳 𝘮𝘢𝘥𝘩𝘺𝘦 𝘨𝘢𝘵𝘢𝘱𝘢𝘵𝘩𝘢 149.6 𝘮𝘪𝘭𝘪𝘰𝘯 𝘬𝘪𝘭𝘰𝘮𝘪𝘵𝘢𝘳 (1 𝘈𝘜), 𝘦𝘪𝘫𝘢𝘯𝘺𝘦 𝘈𝘭𝘰𝘬𝘦𝘳 𝘉𝘩𝘶𝘮𝘪𝘵𝘦 𝘱𝘩𝘶𝘯𝘤𝘩𝘢𝘳 𝘫𝘢𝘯𝘺𝘢𝘳 𝘫𝘢𝘯𝘺𝘢 8 𝘮𝘪𝘯𝘪𝘵𝘦 𝘰 19 𝘴𝘦𝘬𝘦𝘯𝘥𝘢 𝘭𝘢𝘨𝘦. 𝘚𝘶𝘳𝘺𝘢𝘳 𝘱𝘳𝘢𝘬𝘢𝘴𝘩 𝘱𝘳𝘢𝘬𝘳𝘪𝘵𝘪𝘬 𝘱𝘳𝘢𝘯𝘪𝘥𝘦𝘳 𝘫𝘪𝘣𝘢𝘯 𝘱𝘰𝘴𝘢𝘯𝘢 𝘬𝘢𝘳𝘦 𝘱𝘩𝘰𝘵𝘰𝘴𝘪𝘯𝘵𝘩𝘦𝘴𝘪𝘴𝘦𝘳 𝘮𝘢𝘥𝘩𝘺𝘢𝘮𝘦 𝘰 𝘉𝘩𝘶𝘮𝘪𝘳 𝘢𝘣𝘢𝘩𝘢𝘣𝘢𝘯 𝘰 𝘢𝘬𝘢𝘴𝘩𝘢𝘣𝘢𝘵𝘵𝘪 𝘱𝘳𝘢𝘣𝘢𝘣𝘪𝘵𝘢 𝘬𝘢𝘳𝘦. 𝘚𝘶𝘳𝘺𝘢 𝘩𝘺𝘢𝘥𝘳𝘰𝘫𝘦𝘯 (74%), 𝘩𝘦𝘭𝘪𝘺𝘢𝘮 (24%) 𝘰 𝘢𝘯𝘺𝘢 𝘬𝘪𝘮𝘢𝘵𝘪 𝘱𝘢𝘥𝘢𝘳𝘵𝘩𝘦𝘳 𝘴𝘢𝘯𝘨𝘬𝘩𝘺𝘢𝘯 𝘬𝘢𝘳𝘦."
					}, event.threadID, event.messageID);
					break;
				case "2":
					api.sendMessage({
						body: "𝟮. 𝗘𝗮𝗿𝘁𝗵 🌎\n\n𝘗𝘳𝘪𝘵𝘩𝘪𝘣𝘪 𝘣𝘢 𝘔𝘢𝘯𝘥𝘪𝘯𝘪 (𝘊𝘩𝘪𝘯𝘦𝘴𝘦: 地球, 𝘌𝘯𝘨𝘭𝘪𝘴𝘩: 𝘌𝘢𝘳𝘵𝘩), 𝘚𝘶𝘳𝘺𝘢𝘩𝘢𝘳𝘬𝘦𝘳 𝘵𝘳𝘪𝘵𝘪𝘺𝘢 𝘨𝘳𝘢𝘩𝘢, 𝘰 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘣𝘩𝘶𝘮𝘪𝘫𝘢𝘵𝘪𝘺𝘢 𝘨𝘳𝘢𝘩𝘢𝘨𝘶𝘭𝘰𝘥𝘦𝘳 𝘮𝘢𝘥𝘩𝘺𝘦 𝘴𝘢𝘳𝘷𝘢𝘣𝘳𝘪𝘥𝘥𝘩𝘢. 𝘌𝘪 𝘯𝘪𝘭𝘦 𝘨𝘳𝘢𝘩𝘢 (𝘣𝘭𝘶𝘦 𝘱𝘭𝘢𝘯𝘦𝘵) 𝘯𝘢𝘮𝘦𝘰 𝘫𝘢𝘯𝘢, 𝘺𝘦𝘬𝘩𝘢𝘯𝘦 𝘭𝘢𝘬𝘴𝘢 𝘭𝘢𝘬𝘴𝘩𝘢 𝘱𝘳𝘢𝘯𝘪𝘳 𝘱𝘳𝘢𝘯𝘪 𝘣𝘢𝘴𝘢 𝘬𝘢𝘳𝘦, 𝘮𝘢𝘯𝘶𝘴𝘢𝘥𝘪 𝘴𝘢𝘩𝘪𝘵. 𝘗𝘳𝘢𝘺𝘢 4.55 𝘣𝘪𝘭𝘪𝘺𝘢𝘯 𝘣𝘤𝘩𝘢𝘳𝘢𝘨𝘶𝘭𝘰 𝘨𝘢𝘵𝘩𝘪𝘵𝘰 𝘨𝘳𝘢𝘩𝘢𝘵𝘪𝘳 𝘨𝘢𝘵𝘩𝘢𝘯 𝘩𝘢𝘺𝘦𝘤𝘩𝘦 𝘰 𝘱𝘳𝘢𝘺𝘢 1 𝘣𝘪𝘭𝘪𝘺𝘢𝘯 𝘣𝘤𝘩𝘢𝘳𝘢𝘨𝘶𝘭𝘰 𝘵𝘢𝘩𝘢𝘳 𝘴𝘵𝘢𝘱𝘢𝘯𝘢𝘺𝘦 𝘫𝘪𝘣𝘢𝘯𝘦𝘳 𝘢𝘣𝘪𝘳𝘣𝘩𝘢𝘣𝘢 𝘥𝘦𝘬𝘩𝘢 𝘺𝘢𝘺."
					}, event.threadID, event.messageID);
					break;
				case "3":
					api.sendMessage({
						body: "𝟯. 𝗠𝗮𝗿𝘀 🔴\n\n𝘔𝘢𝘳𝘴 𝘣𝘢 𝘔𝘢𝘯𝘨𝘢𝘭 𝘨𝘳𝘢𝘩𝘢 (𝘊𝘩𝘪𝘯𝘦𝘴𝘦: 火星, 𝘌𝘯𝘨𝘭𝘪𝘴𝘩: 𝘔𝘢𝘳𝘴) 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘤𝘩𝘢𝘵𝘶𝘳𝘵𝘩𝘢 𝘨𝘳𝘢𝘩𝘢. 𝘌𝘬𝘦 𝘓𝘢𝘭 𝘨𝘳𝘢𝘩𝘢 (𝘙𝘦𝘥 𝘗𝘭𝘢𝘯𝘦𝘵) 𝘯𝘢𝘮𝘦𝘰 𝘫𝘢𝘯𝘢, 𝘬𝘢𝘳𝘢𝘯 𝘦𝘪 𝘨𝘳𝘢𝘩𝘢𝘳 𝘴𝘵𝘢𝘱𝘢𝘯𝘢𝘺𝘦 𝘭𝘰𝘩𝘢 𝘢𝘮𝘭𝘢𝘬𝘪𝘳 𝘱𝘢𝘳𝘪𝘮𝘢𝘯𝘢 𝘣𝘦𝘴𝘪 𝘺𝘢𝘦𝘳 𝘤𝘩𝘢𝘳𝘢𝘯𝘢 𝘭𝘢𝘭 𝘥𝘦𝘬𝘩𝘢𝘺. 𝘔𝘢𝘯𝘨𝘢𝘭 𝘩𝘢𝘤𝘩𝘢 𝘰 𝘵𝘢𝘯𝘶 𝘣𝘢𝘺𝘶𝘮𝘢𝘯𝘥𝘢𝘭𝘢𝘣𝘪𝘴𝘪𝘴𝘵𝘢 𝘦𝘬𝘵𝘪 𝘱𝘳𝘢𝘴𝘵𝘢𝘳𝘢𝘵𝘮𝘢𝘬 𝘨𝘳𝘢𝘩𝘢. 𝘌𝘪 𝘨𝘳𝘢𝘩𝘢𝘺𝘦 𝘖𝘭𝘺𝘮𝘱𝘶𝘴 𝘔𝘰𝘯𝘴 𝘱𝘢𝘳𝘣𝘢𝘵𝘢, 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘴𝘢𝘳𝘷𝘰𝘤𝘤𝘢 𝘱𝘢𝘳𝘣𝘢𝘵𝘢 𝘰 𝘝𝘢𝘭𝘭𝘦𝘴 𝘔𝘢𝘳𝘪𝘯𝘦𝘳𝘪𝘴 𝘜𝘱𝘢𝘵𝘺𝘢𝘬𝘢, 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘥𝘪𝘳𝘨𝘩𝘢𝘵𝘢𝘮𝘢 𝘜𝘱𝘢𝘵𝘺𝘢𝘬𝘢 𝘵𝘩𝘢𝘬𝘦."
					}, event.threadID, event.messageID); 
					break;
				case "4":
					api.sendMessage({
						body: "𝟰. 𝗩𝗲𝗻𝘂𝘀 🌟\n\n𝘚𝘶𝘬𝘳𝘢 𝘣𝘢 𝘚𝘶𝘬𝘳𝘢 𝘨𝘳𝘢𝘩𝘢 (𝘊𝘩𝘪𝘯𝘦𝘴𝘦: 金星), 𝘛𝘢𝘪𝘣𝘢𝘪 (太白) 𝘯𝘢𝘮𝘦𝘰 𝘫𝘢𝘯𝘢, 𝘩𝘢𝘭𝘢𝘬𝘢 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘥𝘸𝘪𝘵𝘪𝘺𝘢 𝘨𝘳𝘢𝘩𝘢. 𝘊𝘩𝘢𝘯𝘥𝘳𝘢𝘬𝘦 𝘱𝘢𝘳𝘦 𝘪𝘺𝘦 𝘢𝘯𝘥𝘩𝘢𝘬𝘢𝘳𝘢𝘬𝘢𝘴𝘩𝘦 𝘴𝘢𝘳𝘷𝘢𝘱𝘳𝘬𝘢𝘴𝘢 �𝘱𝘢𝘬𝘴𝘢𝘬𝘢 𝘱𝘢𝘥𝘢𝘳𝘵𝘩𝘢, 𝘺𝘢𝘳 𝘱𝘳𝘢𝘬𝘢𝘴𝘩𝘢𝘯𝘢 𝘮𝘢𝘯𝘢 -4.6, 𝘫𝘢 𝘱𝘢𝘯𝘪𝘳 𝘶𝘱𝘢𝘳𝘦 𝘤𝘩𝘩𝘢𝘺𝘢 𝘱𝘢𝘵𝘢𝘯𝘰𝘳 𝘫𝘰𝘨𝘺𝘰. 𝘚𝘶𝘬𝘳𝘢𝘬𝘦 𝘉𝘩𝘶𝘮𝘪𝘩𝘢𝘳𝘬𝘦𝘳 𝘢𝘣𝘢𝘯𝘵𝘢𝘳𝘪𝘬 𝘨𝘳𝘢𝘩𝘢 𝘩𝘪𝘴𝘢𝘣𝘦 𝘨𝘢𝘯𝘢 𝘩𝘢𝘺, 𝘦𝘫𝘢𝘯𝘺𝘦 𝘌𝘬𝘢𝘯𝘵𝘢 𝘣𝘩𝘢𝘪𝘣𝘢𝘯 𝘨𝘳𝘢𝘩𝘢 (𝘴𝘪𝘴𝘵𝘦𝘳 𝘱𝘭𝘢𝘯𝘦𝘵) 𝘣𝘢𝘭𝘢 𝘩𝘢𝘺. 𝘒𝘪𝘯𝘵𝘶 𝘢𝘯𝘺𝘢𝘯𝘺𝘢 𝘥𝘪𝘬𝘥𝘪𝘬𝘦 𝘦 𝘉𝘩𝘶𝘮𝘪𝘩𝘢𝘳𝘬𝘦 𝘤𝘩𝘦𝘺𝘦 𝘣𝘦𝘴𝘪 𝘣𝘩𝘪𝘯𝘯𝘢."
					}, event.threadID, event.messageID); 
					break;
				case "5":
					api.sendMessage({
						body: "𝟱. 𝗝𝘂𝗽𝗶𝘁𝗲𝗿 🪐\n\n𝘎𝘶𝘳𝘶 𝘣𝘢 𝘎𝘶𝘳𝘶 𝘨𝘳𝘢𝘩𝘢 (𝘊𝘩𝘪𝘯𝘦𝘴𝘦: 木星) 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘱𝘢𝘯𝘤𝘢𝘮𝘢 𝘨𝘳𝘢𝘩𝘢 𝘰 𝘴𝘢𝘳𝘷𝘢𝘣𝘳𝘪𝘥𝘥𝘩𝘢 𝘨𝘳𝘢𝘩𝘢. 𝘌𝘪 𝘨𝘢𝘴 𝘥𝘢𝘪𝘵𝘺𝘢 𝘨𝘳𝘢𝘩𝘢, 𝘺𝘢𝘳 𝘣𝘩𝘢𝘳 𝘚𝘶𝘳𝘺𝘢𝘩𝘢𝘳𝘬𝘦𝘳 𝘴𝘢𝘩𝘢𝘴𝘳𝘢𝘮𝘴𝘢 𝘦𝘬𝘢𝘯𝘴𝘢, 𝘬𝘪𝘯𝘵𝘶 𝘢𝘯𝘺𝘢 𝘴𝘢𝘬𝘢𝘭𝘢 𝘨𝘳𝘢𝘩𝘢𝘳 𝘮𝘪𝘭𝘪𝘵𝘢 𝘣𝘩𝘢𝘳𝘦𝘳 𝘤𝘩𝘦𝘺𝘦 𝘥𝘶𝘪 𝘨𝘶𝘯𝘢 𝘣𝘦𝘴𝘪. 𝘙𝘰𝘮𝘢𝘬𝘦𝘳𝘢 𝘎𝘶𝘳𝘶 𝘯𝘢𝘮𝘢𝘬 𝘥𝘦𝘣𝘢𝘵𝘢𝘳 𝘯𝘢𝘮𝘦 𝘢𝘯𝘶𝘴𝘢𝘳𝘦 𝘨𝘳𝘢𝘩𝘢𝘵𝘪𝘳 𝘯𝘢𝘮𝘢𝘯𝘬𝘢𝘯 𝘬𝘢𝘳𝘢 𝘩𝘢𝘺𝘦𝘤𝘩𝘦."
					}, event.threadID, event.messageID); 
					break;
				case "6":
					api.sendMessage({
						body: "𝟲. 𝗨𝗿𝗮𝗻𝘂𝘀 💫\n\n𝘈𝘳𝘥𝘳𝘢 𝘣𝘢 𝘈𝘳𝘥𝘳𝘢 𝘨𝘳𝘢𝘩𝘢 (𝘊𝘩𝘪𝘯𝘦𝘴𝘦: 天王星) 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘴𝘢𝘱𝘵𝘢𝘮𝘢 𝘨𝘳𝘢𝘩𝘢; 𝘛𝘳𝘪𝘫𝘺𝘢 𝘣𝘳𝘪𝘥𝘥𝘩𝘢𝘵𝘢𝘮𝘢 𝘰 𝘤𝘩𝘢𝘵𝘶𝘳𝘵𝘩𝘢 𝘣𝘩𝘢𝘳𝘪 𝘨𝘳𝘢𝘩𝘢. 𝘈𝘳𝘥𝘳𝘢𝘳 𝘱𝘳𝘢𝘬𝘳𝘪𝘵𝘪 𝘕𝘦𝘱𝘵𝘶𝘯𝘦𝘳 𝘴𝘢𝘥𝘳𝘴𝘢. 𝘜𝘣𝘢𝘺𝘦 𝘎𝘢𝘴 𝘥𝘢𝘪𝘵𝘺𝘢 𝘎𝘶𝘳𝘶 𝘰 𝘚𝘢𝘯𝘪𝘩𝘢𝘳𝘬𝘦 𝘤𝘩𝘦𝘺𝘦 𝘣𝘩𝘪𝘯𝘯𝘢. 𝘈𝘳𝘥𝘳𝘢𝘳 𝘣𝘢𝘺𝘶𝘮𝘢𝘯𝘥𝘢𝘭𝘢 𝘮𝘶𝘭𝘢𝘵𝘰 𝘩𝘺𝘢𝘥𝘳𝘰𝘫𝘦𝘯 � 𝘩𝘦𝘭𝘪𝘺𝘢𝘮 𝘥𝘪𝘺𝘦 𝘨𝘢𝘵𝘩𝘪𝘵𝘢, 𝘬𝘪𝘯𝘵𝘶 𝘵𝘢𝘩𝘢𝘵𝘦 𝘬𝘪𝘤𝘩𝘶 𝘱𝘢𝘳𝘪𝘮𝘢𝘯𝘢𝘺 � 𝘱𝘢𝘥𝘢𝘳𝘵𝘩𝘢 𝘰 𝘮𝘦𝘵𝘩𝘦𝘯𝘦𝘰 𝘵𝘩𝘢𝘬𝘦."
					}, event.threadID, event.messageID); 
					break;
				case "7":
					api.sendMessage({
						body: "𝟳. 𝗦𝗮𝘁𝘂𝗿𝗻 🌀\n\n𝘚𝘢𝘯𝘪 𝘣𝘢 𝘚𝘢𝘯𝘪 𝘨𝘳𝘢𝘩𝘢 (𝘊𝘩𝘪𝘯𝘦𝘴𝘦: 土星) 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘴𝘢𝘴𝘵𝘩𝘢 𝘨𝘳𝘢𝘩𝘢 𝘰 𝘥𝘸𝘪𝘵𝘪𝘺𝘢 𝘣𝘳𝘪𝘥𝘥𝘩𝘢𝘵𝘢𝘮𝘢 𝘨𝘳𝘢𝘩𝘢. 𝘎𝘳𝘢𝘩𝘢𝘵𝘪𝘳 𝘐𝘯𝘨𝘳𝘢𝘫𝘪 𝘯𝘢𝘮𝘢 𝘙𝘰𝘮𝘢𝘯 𝘥𝘦𝘣𝘢𝘵𝘢 𝘚𝘢𝘵𝘶𝘳𝘯𝘦𝘳 𝘯𝘢𝘮𝘦 𝘢𝘯𝘶𝘴𝘢𝘳𝘦 𝘥𝘪𝘺𝘦𝘤𝘩𝘦, 𝘨𝘳𝘢𝘩𝘢𝘵𝘪𝘳 𝘫𝘺𝘰𝘵𝘪𝘴𝘩 𝘤𝘪𝘩𝘯𝘢 (♄) 𝘥𝘦𝘣𝘢𝘵𝘢𝘳 𝘬𝘢𝘵𝘢𝘳𝘪 𝘱𝘳𝘢𝘵𝘪𝘬 𝘬𝘢𝘳𝘦."
					}, event.threadID, event.messageID); 
					break;
				case "8":
					api.sendMessage({
						body: "𝟴. 𝗠𝗲𝗿𝗰𝘂𝗿𝘆 ☿️\n\n𝘉𝘶𝘥𝘩𝘢 𝘣𝘢 𝘉𝘶𝘥𝘩𝘢 𝘨𝘳𝘢𝘩𝘢 (𝘊𝘩𝘪𝘯𝘦𝘴𝘦: 水星) 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘢𝘴𝘵𝘢𝘮𝘢 𝘨𝘳𝘢𝘩𝘢𝘨𝘶𝘭𝘰𝘥𝘦𝘳 𝘮𝘢𝘥𝘩𝘺𝘦 𝘴𝘢𝘳𝘷𝘢𝘬𝘴𝘩𝘶𝘥𝘳𝘢 𝘰 𝘚𝘶𝘳𝘺𝘢𝘩𝘢𝘳𝘬𝘦 𝘴𝘢𝘳𝘷𝘢𝘯𝘪𝘬𝘢𝘵𝘢𝘮𝘢 𝘨𝘳𝘢𝘩𝘢, 𝘺𝘢𝘳 𝘱𝘢𝘳𝘪𝘬𝘳𝘢𝘮𝘢𝘬𝘢𝘭𝘢 88 𝘥𝘪𝘯. 𝘉𝘩𝘶𝘮𝘪𝘩𝘢𝘳𝘬𝘦 𝘥𝘦𝘬𝘩𝘢𝘭𝘦 𝘨𝘳𝘢𝘩𝘢𝘵𝘪 𝘱𝘳𝘢𝘺𝘢 116 𝘥𝘪𝘯𝘦 𝘢𝘬𝘵𝘪 𝘱𝘶𝘳𝘯𝘢 𝘬𝘢𝘳𝘦, 𝘺𝘢 𝘢𝘯𝘺𝘢 𝘨𝘳𝘢𝘩𝘢𝘩𝘢𝘳𝘬𝘦 �𝘤𝘩𝘦𝘺𝘦 𝘥𝘳𝘶𝘵𝘢𝘵𝘢𝘳𝘢."
					}, event.threadID, event.messageID); 
					break;
				case "9":
					api.sendMessage({
						body: "𝟵. 𝗡𝗲𝗽𝘁𝘂𝗻𝗲 🌊\n\n𝘕𝘪𝘳𝘣𝘢𝘴𝘸𝘢𝘳𝘪 𝘣𝘢 �𝘕𝘪𝘳𝘣𝘢𝘴𝘸𝘢𝘳𝘪 𝘨𝘳𝘢𝘩𝘢 (𝘊𝘩𝘪𝘯𝘦𝘴𝘦: 海王星) 𝘚𝘰𝘭𝘢𝘳 𝘚𝘺𝘴𝘵𝘦𝘮𝘦𝘳 𝘢𝘴𝘵𝘢𝘮𝘢 𝘰 𝘚𝘶𝘳𝘺𝘢𝘩𝘢𝘳𝘬𝘦 𝘴𝘢𝘳𝘷𝘢𝘥𝘶𝘳𝘢𝘵𝘢𝘮𝘢 𝘨𝘳𝘢𝘩𝘢. 𝘊𝘩𝘢𝘵𝘶𝘳𝘵𝘩𝘢 𝘣𝘳𝘪𝘥𝘥𝘩𝘢𝘵𝘢𝘮𝘢 𝘨𝘳𝘢𝘩𝘢 𝘰 𝘵𝘳𝘪𝘵𝘪𝘺𝘢 𝘣𝘩𝘢𝘳𝘪 𝘨𝘳𝘢𝘩𝘢. 𝘙𝘰𝘮𝘢𝘯 𝘴𝘢𝘮𝘶𝘥𝘳𝘢𝘳 𝘥𝘦𝘣𝘢𝘵𝘢 𝘕𝘦𝘱𝘵𝘶𝘯𝘦𝘳 𝘯𝘢𝘮𝘦 𝘢𝘯𝘶𝘴𝘢𝘳𝘦 𝘨𝘳𝘢𝘩𝘢𝘵𝘪𝘳 𝘯𝘢𝘮𝘢𝘯𝘬𝘢𝘯 𝘬𝘢𝘳𝘢 𝘩𝘢𝘺𝘦𝘤𝘩𝘦."
					}, event.threadID, event.messageID); 
					break;
				case "10":
					api.sendMessage({
						body: "𝟭𝟬. 𝗧𝗵𝗲 𝗠𝗼𝗼𝗻 🌕\n\n𝘊𝘩𝘢𝘯𝘥𝘳𝘢 𝘉𝘩𝘶𝘮𝘪𝘳 𝘴𝘢𝘵𝘦𝘭𝘭𝘢𝘪𝘵, 𝘺𝘢𝘬𝘦 𝘊𝘩𝘢𝘯𝘥𝘳𝘢, 𝘚𝘢𝘴𝘪, 𝘏𝘢𝘯𝘨𝘢, 𝘛𝘩𝘢𝘪 𝘠𝘪𝘯 𝘢𝘥𝘪 𝘯𝘢𝘮𝘦𝘰 𝘫𝘢𝘯𝘦. 𝘈𝘯𝘺𝘢 𝘨𝘳𝘢𝘩𝘢𝘩𝘢𝘳 𝘴𝘢𝘵𝘦𝘭𝘭𝘢𝘪𝘵𝘢𝘥𝘦𝘳 𝘤𝘩𝘦𝘺𝘦 𝘊𝘩𝘢𝘯𝘥𝘳𝘢𝘬𝘦 𝘢𝘭𝘢𝘥𝘢 𝘬𝘱𝘢𝘬𝘢𝘳𝘪 𝘯𝘢𝘮𝘦 𝘯𝘦𝘪. 𝘊𝘩𝘢𝘯𝘥𝘳𝘢𝘳 𝘒𝘦𝘯𝘥𝘳𝘢 𝘩𝘢𝘵𝘦 𝘉𝘩𝘶𝘮𝘪𝘳 𝘔𝘢𝘥𝘩𝘺𝘦 𝘨𝘢𝘵𝘢𝘱𝘢𝘵𝘩𝘢 384,403 𝘬𝘪.𝘮𝘪. 𝘊𝘩𝘢𝘯𝘥𝘳𝘢𝘳 𝘣𝘺𝘢𝘴 3,474 𝘬𝘪.𝘮𝘪. 𝘊𝘩𝘢𝘯𝘥𝘳𝘢 𝘉𝘩𝘶𝘮𝘪𝘬𝘦 27.32 𝘥𝘪𝘯𝘦 𝘱𝘢𝘳𝘪𝘬𝘳𝘮𝘢 𝘬𝘢𝘳𝘦."
					}, event.threadID, event.messageID); 
					break;
				default:
					const choose = parseInt(event.body);
					if (isNaN(event.body)) return api.sendMessage("𝘋𝘶𝘺𝘢 𝘬𝘢𝘳𝘦 1 𝘵𝘩𝘦𝘬𝘦 10 𝘦𝘳 𝘮𝘢𝘥𝘩𝘺𝘦 𝘦𝘬𝘢𝘬𝘪 𝘴𝘢𝘯𝘬𝘩𝘺𝘢 𝘭𝘦𝘬𝘩𝘶𝘯", event.threadID, event.messageID);
					if (choose > 10 || choose < 1) return api.sendMessage("𝘈𝘵𝘪𝘵𝘬𝘳𝘢𝘯𝘵𝘢 𝘴𝘢𝘯𝘬𝘩𝘺𝘢 𝘱𝘢𝘵𝘩𝘢𝘯𝘰 𝘩𝘢𝘭𝘰, 1 𝘵𝘩𝘦𝘬𝘦 10 𝘦𝘳 𝘮𝘢𝘥𝘩𝘺𝘦 𝘭𝘦𝘬𝘩𝘶𝘯", event.threadID, event.messageID); 
			}
		}
	}
}

module.exports.run = async ({ api, event, handleReply }) => {
	const fs = require("fs");
	const { threadID, messageID, senderID } = event;
	return api.sendMessage({ 
		body: "𝗦𝗼𝗹𝗮𝗿 𝗦𝘆𝘀𝘁𝗲𝗺 𝗜𝗻𝗳𝗼𝗿𝗺𝗮𝘁𝗶𝗼𝗻" +
		"\n\n𝟭. 𝗧𝗵𝗲 𝗦𝘂𝗻 ☀️" +
		"\n𝟮. 𝗘𝗮𝗿𝘁𝗵 🌎" +
		"\n𝟯. 𝗠𝗮𝗿𝘀 🔴" +
		"\n𝟰. 𝗩𝗲𝗻𝘂𝘀 🌟" +
		"\n𝟱. 𝗝𝘂𝗽𝗶𝘁𝗲𝗿 🪐" +
		"\n𝟲. 𝗨𝗿𝗮𝗻𝘂𝘀 💫" +
		"\n𝟳. 𝗦𝗮𝘁𝘂𝗿𝗻 🌀" +
		"\n𝟴. 𝗠𝗲𝗿𝗰𝘂𝗿𝘆 ☿️" +
		"\n𝟵. 𝗡𝗲𝗽𝘁𝘂𝗻𝗲 🌊" +
		"\n𝟭𝟬. 𝗧𝗵𝗲 𝗠𝗼𝗼𝗻 🌕" +
		"\n\n𝘗𝘳𝘢𝘯𝘪𝘨𝘶𝘭𝘪 𝘣𝘪𝘴𝘢𝘺𝘦𝘳 𝘫𝘢𝘯𝘵𝘦 𝘴𝘢𝘯𝘬𝘩𝘺𝘢𝘥𝘪𝘺𝘦 𝘳𝘪𝘱𝘭𝘢𝘺 𝘬𝘢𝘳𝘶𝘯 (𝟭-𝟭𝟬)",
		attachment: fs.createReadStream(__dirname + "/noprefix/solar.gif")
	}, threadID, (error, info) => {
		global.client.handleReply.push({
			type: "choosee",
			name: this.config.name,
			author: senderID,
			messageID: info.messageID
		})  
	})
}
